In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder
from sklearn.compose import ColumnTransformer
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_absolute_error
from sklearn.metrics import mean_squared_error
from sklearn.metrics import r2_score
from sklearn.preprocessing import StandardScaler
import pickle

In [7]:
data = pd.read_csv("Dataset/processed.csv")

In [8]:
data.head()

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,Name
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,1.75,Maruti Wagon R LXI CNG
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,12.50,Hyundai Creta 1.6 CRDi SX Option
2,Chennai,2011,46000,Petrol,Manual,First,18.20,1199.0,88.70,5.0,4.50,Honda Jazz V
3,Chennai,2012,87000,Diesel,Manual,First,20.77,1248.0,88.76,7.0,6.00,Maruti Ertiga VDI
4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968.0,140.80,5.0,17.74,Audi A4 New 2.0 TDI Multitronic

In [9]:
data.drop(["Mileage", "Engine", "Power", "Seats"], axis=1, inplace=True)

In [10]:
data.head()

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Price,Name
0,Mumbai,2010,72000,CNG,Manual,First,1.75,Maruti Wagon R LXI CNG
1,Pune,2015,41000,Diesel,Manual,First,12.50,Hyundai Creta 1.6 CRDi SX Option
2,Chennai,2011,46000,Petrol,Manual,First,4.50,Honda Jazz V
3,Chennai,2012,87000,Diesel,Manual,First,6.00,Maruti Ertiga VDI
4,Coimbatore,2013,40670,Diesel,Automatic,Second,17.74,Audi A4 New 2.0 TDI Multitronic

In [11]:
Y = data["Price"]
Y

0        1.75
1       12.50
2        4.50
3        6.00
4       17.74
        ...
6014     4.75
6015     4.00
6016     2.90
6017     2.65
6018     2.50
Name: Price, Length: 6019, dtype: float64

In [14]:
X = data.iloc[:, [0, 1, 2, 3, 4, 5, 7]]

In [15]:
X.head()

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Name
0,Mumbai,2010,72000,CNG,Manual,First,Maruti Wagon R LXI CNG
1,Pune,2015,41000,Diesel,Manual,First,Hyundai Creta 1.6 CRDi SX Option
2,Chennai,2011,46000,Petrol,Manual,First,Honda Jazz V
3,Chennai,2012,87000,Diesel,Manual,First,Maruti Ertiga VDI
4,Coimbatore,2013,40670,Diesel,Automatic,Second,Audi A4 New 2.0 TDI Multitronic

In [16]:
X["Fuel_Type"].unique()

array(['CNG', 'Diesel', 'Petrol', 'LPG', 'Electric'], dtype=object)

In [17]:
X.replace({'CNG':0, 'Diesel':1, 'Petrol':2, 'LPG':3, 'Electric':4}, inplace=True)

/home/ritik/.local/lib/python3.6/site-packages/pandas/core/frame.py:4172: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  method=method,

In [18]:
X["Transmission"].unique()

array(['Manual', 'Automatic'], dtype=object)

In [19]:
X.replace({'Manual':0, 'Automatic':1}, inplace=True)

In [20]:
X["Owner_Type"].unique()

array(['First', 'Second', 'Fourth & Above', 'Third'], dtype=object)

In [21]:
X.replace({'First':0, 'Second':1, 'Fourth & Above':3, 'Third':2}, inplace=True)

In [22]:
X.head()

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Name
0,Mumbai,2010,72000,0,0,0,Maruti Wagon R LXI CNG
1,Pune,2015,41000,1,0,0,Hyundai Creta 1.6 CRDi SX Option
2,Chennai,2011,46000,2,0,0,Honda Jazz V
3,Chennai,2012,87000,1,0,0,Maruti Ertiga VDI
4,Coimbatore,2013,40670,1,1,1,Audi A4 New 2.0 TDI Multitronic

# Label Encoding Our Dataset

In [95]:
columnTransformer = ColumnTransformer([('encoder', 
                                        OneHotEncoder(), 
                                        [0, 10])], 
                                      remainder='passthrough')

In [96]:
X = columnTransformer.fit_transform(X)
X

<6019x1896 sparse matrix of type '<class 'numpy.float64'>'
	with 56856 stored elements in Compressed Sparse Row format>

# Applying train test splt

In [97]:
X_train, X_test,y_train,y_test=train_test_split(X,Y,test_size=0.2)

# Training Initial Model

In [98]:
regressor=LinearRegression()
regressor.fit(X_train,y_train)

LinearRegression()

In [99]:
y_pred = regressor.predict(X_test)

In [100]:
print("MAE =", mean_absolute_error(y_test,y_pred))
mse=mean_squared_error(y_test,y_pred)
print("MSE =", mse)
print("RMSE =", np.sqrt(mse))
print("R-Squre", r2_score(y_test,y_pred))

MAE = 2.1623478920922787
MSE = 17.03242887279762
RMSE = 4.127036330443145
R-Squre 0.8588426228861145

In [117]:
pickle.dump(regressor, open('model.pkl', 'wb'))

In [118]:
pickle.dump(columnTransformer, open('data.pkl', 'wb'))

In [108]:
ans = np.array(['Mumbai', 2019, 2000, 0, 1, 2, 20, 1000, 5, 10, 'Honda Jazz V'])

In [109]:
d = {"d": ans}

In [110]:
d = pd.DataFrame(d)

In [111]:
d = d.transpose()

In [70]:
an.tolist()

['Mumbai',
 2010,
 72000,
 0,
 0,
 0,
 26.6,
 998.0,
 58.16,
 5.0,
 'Maruti Wagon R LXI CNG']

In [112]:
x = columnTransformer.transform(d)

/home/ritik/.local/lib/python3.6/site-packages/sklearn/compose/_column_transformer.py:440: FutureWarning: Given feature/column names or counts do not match the ones for the data given during fit. This will fail from v0.24.
  FutureWarning)

In [113]:
regressor.predict(x)

array([-1.23672725])

In [107]:
columnTransformer.sparse_output_

True